app/views/tasks/_filter.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
  <p>
    <%= f.collection_select(:category_id, Category.all, :id, :name,
                            { :selected => params[:category_id],
                              :include_blank => true }) %>