app/views/tasks/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
    <%= f.label :category_list, "Select Categories" %><br>
    <%= f.collection_select(:category_list,
                            Category.all.order(name: :asc), :id, :name,
                            { :selected => @task.categories.map do |t|
                                             t.id
                                           end,
                              :include_blank => true },
                            { :multiple => true }) %>