app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 5]]
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy