app/controllers/tasks_controller.rb

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy