app/controllers/tasks_controller.rb

  def index
    filter_cookies
    @tasks = Task.filter(filtering_params(params))
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    respond_to do |format|
      format.html {
        @task = Task.new(task_params)
        if @task.save
          redirect_to @task
        else
          render 'new'
        end
      }
      format.js {
        title, date, priority, category = params[:title],
          params[:date], params[:priority], params[:category]
        @task = Task.new(title: title, duedate: date, priority: priority,
                         repeat: 0)
        @task.categories += Category.where(id: category)

        if @task.save
---
INSERT INTO "tasks" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Run"], ["created_at", "2018-12-19 15:52:59.812607"], ["updated_at", "2018-12-19 15:52:59.812607"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "categorisings" ON "categories"."id" = "categorisings"."category_id" WHERE "categorisings"."task_id" = ?  [["task_id", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Health"], ["created_at", "2018-12-19 15:35:15.387108"], ["updated_at", "2018-12-19 15:35:15.387108"]]
UPDATE "tasks" SET "completed" = ?, "duedate" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["duedate", "2018-12-22 14:15:00"], ["updated_at", "2018-12-20 17:24:46.308840"], ["id", 3]]

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      format.html {
        if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "duedate" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["duedate", "2018-12-22 14:15:00"], ["updated_at", "2018-12-20 17:24:46.308840"], ["id", 3]]