app/models/task.rb

  def category_list=(names)
    self.categories = names.split(',').map do |n|
      Category.where(name: n.strip).first_or_create!
---
SELECT "categories".* FROM "categories" INNER JOIN "categorisings" ON "categories"."id" = "categorisings"."category_id" WHERE "categorisings"."task_id" = ?  [["task_id", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Work"], ["created_at", "2018-12-20 17:38:38.650977"], ["updated_at", "2018-12-20 17:38:38.650977"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["name", "Health"], ["LIMIT", 1]]